# Terraform environment test
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD04MGJmZjNlNi0xNmM0LTQ4MzktOWNlOC02MGMxYTgzMWNlNTI7b2JqZWN0SWQ9YjU5YWI3YjktZGIzOC00YmQzLTg2MTQtZTZkMTBhZDcwYjExO3N1YnNjcmlwdGlvbklkPTdiNmY4ZjE1LTNhM2UtNDNhMi1iNmFjLThlYjZjMDZhZDEwMzt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_monitor_action_group.email_ag will be created
  + resource "azurerm_monitor_action_group" "email_ag" {
      + enabled             = true
      + id                  = (known after apply)
      + location            = "global"
      + name                = "DD-email-notification-test-ag"
      + resource_group_name = "altinn-digdir-oed-tt02-rg"
      + short_name          = "E-mail DD-T"

      + email_receiver {
          + email_address = "digitalt-dodsbo-test-aaaapwt4zc7waueeb6s5s6j2qi@digdir.slack.com"
          + name          = "send-to-EmailAction"
        }
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.SensitiveHeir_ar will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "SensitiveHeir_ar" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "Sensitive heir address code 4,6 or 7"
      + display_name                           = "Sensitive heir address code 4,6 or 7"
      + enabled                                = true
      + evaluation_frequency                   = "PT5M"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "norwayeast"
      + name                                   = "Sensitive heir address code 4,6 or 7"
      + resource_group_name                    = "altinn-digdir-oed-tt02-rg"
      + scopes                                 = [
          + "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/monitor-digdir-tt02-rg/providers/Microsoft.OperationalInsights/workspaces/application-digdir-tt02-law",
        ]
      + severity                               = 1
      + target_resource_types                  = [
          + "Microsoft.OperationalInsights/workspaces",
        ]
      + window_duration                        = "PT5M"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups = (known after apply)
        }

      + criteria {
          + operator                = "GreaterThanOrEqual"
          + query                   = <<-EOT
                AppTraces
                | where AppRoleName startswith "oed"
                | where Properties.EventId == 5002
            EOT
          + threshold               = 1
          + time_aggregation_method = "Count"

          + failing_periods {
              + minimum_failing_periods_to_trigger_alert = 1
              + number_of_evaluation_periods             = 1
            }
        }
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.deadisalive_ar will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "deadisalive_ar" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "Deceased is alive and instance already exists"
      + display_name                           = "Deceased is alive and instance already exists"
      + enabled                                = true
      + evaluation_frequency                   = "PT5M"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "norwayeast"
      + name                                   = "Deceased is alive and instance already exists"
      + resource_group_name                    = "altinn-digdir-oed-tt02-rg"
      + scopes                                 = [
          + "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/monitor-digdir-tt02-rg/providers/Microsoft.OperationalInsights/workspaces/application-digdir-tt02-law",
        ]
      + severity                               = 1
      + target_resource_types                  = [
          + "Microsoft.OperationalInsights/workspaces",
        ]
      + window_duration                        = "PT5M"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups = (known after apply)
        }

      + criteria {
          + operator                = "GreaterThanOrEqual"
          + query                   = <<-EOT
                AppTraces
                | where AppRoleName startswith "oed"
                | where Properties.EventId == 5000
            EOT
          + threshold               = 1
          + time_aggregation_method = "Count"

          + failing_periods {
              + minimum_failing_periods_to_trigger_alert = 1
              + number_of_evaluation_periods             = 1
            }
        }
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.failed_to_archive_ar will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "failed_to_archive_ar" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "Archiving has failed"
      + display_name                           = "Archiving has failed"
      + enabled                                = true
      + evaluation_frequency                   = "PT5M"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "norwayeast"
      + name                                   = "Archiving has failed"
      + resource_group_name                    = "altinn-digdir-oed-tt02-rg"
      + scopes                                 = [
          + "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/monitor-digdir-tt02-rg/providers/Microsoft.OperationalInsights/workspaces/application-digdir-tt02-law",
        ]
      + severity                               = 1
      + target_resource_types                  = [
          + "Microsoft.OperationalInsights/workspaces",
        ]
      + window_duration                        = "PT5M"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups = (known after apply)
        }

      + criteria {
          + operator                = "GreaterThanOrEqual"
          + query                   = <<-EOT
                AppTraces
                | where AppRoleName startswith "oed"
                | where Message startswith "Failed to archive" or Properties.EventId == 4004
            EOT
          + threshold               = 1
          + time_aggregation_method = "Count"

          + failing_periods {
              + minimum_failing_periods_to_trigger_alert = 1
              + number_of_evaluation_periods             = 1
            }
        }
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.freg_failed_ar will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "freg_failed_ar" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "FReg has failed"
      + display_name                           = "FReg has failed"
      + enabled                                = true
      + evaluation_frequency                   = "PT15M"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "norwayeast"
      + name                                   = "FReg has failed"
      + resource_group_name                    = "altinn-digdir-oed-tt02-rg"
      + scopes                                 = [
          + "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/monitor-digdir-tt02-rg/providers/Microsoft.OperationalInsights/workspaces/application-digdir-tt02-law",
        ]
      + severity                               = 0
      + target_resource_types                  = [
          + "Microsoft.OperationalInsights/workspaces",
        ]
      + window_duration                        = "PT15M"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups = (known after apply)
        }

      + criteria {
          + operator                = "GreaterThanOrEqual"
          + query                   = <<-EOT
                AppTraces
                | where AppRoleName startswith "oed"
                | Properties.EventId == 4005
            EOT
          + threshold               = 1
          + time_aggregation_method = "Count"

          + failing_periods {
              + minimum_failing_periods_to_trigger_alert = 1
              + number_of_evaluation_periods             = 1
            }
        }
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.minor_heir_ar will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "minor_heir_ar" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "One or more heirs are minors"
      + display_name                           = "One or more heirs are minors"
      + enabled                                = true
      + evaluation_frequency                   = "PT30M"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "norwayeast"
      + name                                   = "One or more heirs are minors"
      + resource_group_name                    = "altinn-digdir-oed-tt02-rg"
      + scopes                                 = [
          + "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/monitor-digdir-tt02-rg/providers/Microsoft.OperationalInsights/workspaces/application-digdir-tt02-law",
        ]
      + severity                               = 2
      + target_resource_types                  = [
          + "Microsoft.OperationalInsights/workspaces",
        ]
      + window_duration                        = "PT30M"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups = (known after apply)
        }

      + criteria {
          + operator                = "GreaterThanOrEqual"
          + query                   = <<-EOT
                AppTraces
                | where AppRoleName startswith "oed"
                | Properties.EventId == 3000
            EOT
          + threshold               = 1
          + time_aggregation_method = "Count"

          + failing_periods {
              + minimum_failing_periods_to_trigger_alert = 1
              + number_of_evaluation_periods             = 1
            }
        }
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.misposted_ar will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "misposted_ar" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "The estate is misposted from DA"
      + display_name                           = "The estate is misposted from DA"
      + enabled                                = true
      + evaluation_frequency                   = "PT30M"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "norwayeast"
      + name                                   = "The estate is misposted from DA"
      + resource_group_name                    = "altinn-digdir-oed-tt02-rg"
      + scopes                                 = [
          + "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/monitor-digdir-tt02-rg/providers/Microsoft.OperationalInsights/workspaces/application-digdir-tt02-law",
        ]
      + severity                               = 3
      + target_resource_types                  = [
          + "Microsoft.OperationalInsights/workspaces",
        ]
      + window_duration                        = "PT30M"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups = (known after apply)
        }

      + criteria {
          + operator                = "GreaterThanOrEqual"
          + query                   = <<-EOT
                AppTraces
                | where AppRoleName startswith "oed"
                | Properties.EventId == 2002
            EOT
          + threshold               = 1
          + time_aggregation_method = "Count"

          + failing_periods {
              + minimum_failing_periods_to_trigger_alert = 1
              + number_of_evaluation_periods             = 1
            }
        }
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.partyservice_failed_ar will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "partyservice_failed_ar" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "Partyservice has failed"
      + display_name                           = "Partyservice has failed"
      + enabled                                = true
      + evaluation_frequency                   = "PT15M"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "norwayeast"
      + name                                   = "Partyservice has failed"
      + resource_group_name                    = "altinn-digdir-oed-tt02-rg"
      + scopes                                 = [
          + "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/monitor-digdir-tt02-rg/providers/Microsoft.OperationalInsights/workspaces/application-digdir-tt02-law",
        ]
      + severity                               = 0
      + target_resource_types                  = [
          + "Microsoft.OperationalInsights/workspaces",
        ]
      + window_duration                        = "PT15M"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups = (known after apply)
        }

      + criteria {
          + operator                = "GreaterThanOrEqual"
          + query                   = <<-EOT
                AppTraces
                | where AppRoleName startswith "oed"
                | Properties.EventId == 4005
            EOT
          + threshold               = 1
          + time_aggregation_method = "Count"

          + failing_periods {
              + minimum_failing_periods_to_trigger_alert = 1
              + number_of_evaluation_periods             = 1
            }
        }
    }

  # azurerm_windows_function_app.feedpoller will be updated in-place
  ~ resource "azurerm_windows_function_app" "feedpoller" {
      ~ app_settings                                   = {
          + "FUNCTIONS_EXTENSION_VERSION"            = "~4"
          - "MaskinportenSettings:DaResource"        = "https://oppgjoer-etter-doedsfall.apps.ocp.test.domstol.no/api" -> null
          - "MaskinportenSettings:OedEventsResource" = "https://digdir.apps.altinn.no/digdir/oed-events/da-events/api/v1" -> null
          + "MaskinportenSettings:Resource"          = "https://oppgjoer-etter-doedsfall.apps.ocp.test.domstol.no/api"
          ~ "MaskinportenSettings:Scope"             = "domstol:forvaltningssaker:doedsfall.read altinn:serviceowner/events altinn:dd:internalevents" -> "domstol:forvaltningssaker:doedsfall.read altinn:serviceowner/events altinn:dd:internal"
            # (9 unchanged elements hidden)
        }
        id                                             = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.Web/sites/oed-test-feedpoller-func"
        name                                           = "oed-test-feedpoller-func"
        tags                                           = {
            "costcenter"                                     = "altinn3"
            "hidden-link: /app-insights-conn-string"         = (sensitive value)
            "hidden-link: /app-insights-instrumentation-key" = (sensitive value)
            "hidden-link: /app-insights-resource-id"         = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.Insights/components/oed-test-feedpoller-ai"
            "solution"                                       = "apps"
        }
        # (33 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 8 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @kurt70 |
| Action | `push` |
| Working Directory | `./infra/altinn-digdir-oed-tt02-rg` |
| State File | `github.com/altinn/dd-infrastructure/environments/test/altinn-digdir-oed-tt02-rg.tfstate` |
| Plan File | `github.com_altinn_dd-infrastructure_environments_test_altinn-digdir-oed-tt02-rg.tfstate.tfplan`